In [9]:
import sqlite3

In [10]:
connection = sqlite3.connect('exampleDatBase1.db')

cursor = connection.cursor()


command1 = """CREATE TABLE IF NOT EXISTS
            cities(city_id INTEGER PRIMARY KEY, location TEXT)"""

cursor.execute(command1)

command2 = """CREATE TABLE IF NOT EXISTS
            living(living_id INTEGER PRIMARY KEY, city_id INTEGER, living_cost FLOAT, FOREIGN KEY(city_id) REFERENCES cities(city_id))"""

cursor.execute(command2)

In [11]:
cursor.execute("INSERT INTO cities VALUES (21, 'Mineapolis, MN')")
cursor.execute("INSERT INTO cities VALUES (25, 'Duluth, MN')")
cursor.execute("INSERT INTO cities VALUES (31, 'Chicago, IL')")
cursor.execute("INSERT INTO cities VALUES (67, 'Austin, TX')")

In [12]:
cursor.execute("INSERT INTO living VALUES (55, 21, 55.88)")
cursor.execute("INSERT INTO living VALUES (59, 25, 35.08)")
cursor.execute("INSERT INTO living VALUES (61, 31, 65.68)")
cursor.execute("INSERT INTO living VALUES (103, 67, 75.22)")

In [14]:
cursor.execute("SELECT * FROM cities")

results = cursor.fetchall()
print(results)

[(21, 'Mineapolis, MN'), (25, 'Duluth, MN'), (31, 'Chicago, IL'), (67, 'Austin, TX')]